In [129]:
import sklearn
import pandas as pd
import matplotlib.pyplot as plt

In [130]:
titanic_df.shape

(712, 9)

In [131]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_df.head(10)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,1,"Lu, Emory",male,15.0,1,0,A/5 21171,0.1000,C25,S
1,2,0,3,"Han, Daniel",nonbinary,15.0,1,0,PC 17599,71.2833,NaN,C
2,3,0,3,"Zhuang, Evan",xe/xem,15.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [132]:
titanic_df[titanic_df.isnull().any(axis=1)].count()

PassengerId    708
Survived       708
Pclass         708
Name           708
Gender         708
Age            531
SibSp          708
Parch          708
Ticket         708
Fare           708
Cabin           21
Embarked       706
dtype: int64

In [133]:
titanic_df.drop(['PassengerId', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [134]:
titanic_df.head(10)

,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Fare,Embarked
0,1,1,"Lu, Emory",male,15.0,1,0,0.1000,S
1,0,3,"Han, Daniel",nonbinary,15.0,1,0,71.2833,C
2,0,3,"Zhuang, Evan",xe/xem,15.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S
5,0,3,"Moran, Mr. James",male,NaN,0,0,8.4583,Q
6,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,S
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,21.0750,S
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,11.1333,S
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,30.0708,C

In [135]:
titanic_df = titanic_df.dropna()

In [136]:
titanic_df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  712.000000  712.000000  712.000000  712.000000  712.000000  712.000000
mean     0.403090    2.240169   29.584508    0.514045    0.432584   34.557209
std      0.490863    0.836854   14.517140    0.930692    0.854181   52.944515
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    1.000000   20.000000    0.000000    0.000000    8.050000
50%      0.000000    2.000000   28.000000    0.000000    0.000000   15.645850
75%      1.000000    3.000000   38.000000    1.000000    1.000000   33.000000
max      1.000000    3.000000   80.000000    5.000000    6.000000  512.329200

In [137]:
pd.crosstab(titanic_df['Gender'], titanic_df['Survived'])

Survived     0    1
Gender
female      62  185
male       354   94
nonbinary    1    0
xe/xem       8    8

In [138]:
pd.crosstab(titanic_df['Pclass'], titanic_df['Survived'])

Survived    0    1
Pclass
1          64  120
2          90   83
3         271   84